<?php

namespace app\components;

class Translit {
    public static $uz2oz = [
        "Ғ" => "G'",
        "ғ" => "g'",
        "Ў" => "O'",
        "ў" => "o'",
        "ъ" => "ʼ",
        "A" => "A",
        "а" => "a",
        "Б" => "B",
        "б" => "b",
        "Д" => "D",
        "д" => "d",
        "Е" => "E",
        "е" => "e",
        "Ё" => "Yo",
        "ё" => "yo",
        "Ф" => "F",
        "ф" => "f",
        "Г" => "G",
        "г" => "g",
        "Ҳ" => "H",
        "ҳ" => "h",
        "И" => "I",
        "и" => "i",
        "Ж" => "J",
        "ж" => "j",
        "К" => "K",
        "к" => "k",
        "Л" => "L",
        "л" => "l",
        "М" => "M",
        "м" => "m",
        "Н" => "N",
        "н" => "n",
        "О" => "O",
        "о" => "o",
        "П" => "P",
        "п" => "p",
        "Қ" => "Q",
        "қ" => "q",
        "Р" => "R",
        "р" => "r",
        "С" => "S",
        "с" => "s",
        "Т" => "T",
        "т" => "t",
        "У" => "U",
        "у" => "u",
        "В" => "V",
        "в" => "v",
        "Х" => "X",
        "х" => "x",
        "Й" => "Y",
        "й" => "y",
        "З" => "Z",
        "з" => "z",
        "Ч" => "Ch",
        "ч" => "ch",
        "Ш" => "Sh",
        "ш" => "sh",
        "э" => "e",
        "Э" => "E",
        "Ю" => "Yu",
        "ю" => "yu",
        "Я" => "Ya",
        "я" => "ya",
    ];
    public static $oz2uz = [
        "G'" => "Ғ",
        "g'" => "ғ",
        "O'" => "Ў",
        "o'" => "ў",
        "ʼ" => "ъ",
        "A" => "A",
        "a" => "а",
        "B" => "Б",
        "b" => "б",
        "D" => "Д",
        "d" => "д",
        "E" => "Е",
        "e" => "е",
        "Yo" => "Ё",
        "yo" => "ё",
        "F" => "Ф",
        "f" => "ф",
        "G" => "Г",
        "g" => "г",
        "H" => "Ҳ",
        "h" => "ҳ",
        "I" => "И",
        "i" => "и",
        "J" => "Ж",
        "j" => "ж",
        "K" => "К",
        "k" => "к",
        "L" => "Л",
        "l" => "л",
        "M" => "М",
        "m" => "м",
        "N" => "Н",
        "n" => "н",
        "O" => "О",
        "o" => "о",
        "P" => "П",
        "p" => "п",
        "Q" => "Қ",
        "q" => "қ",
        "R" => "Р",
        "r" => "р",
        "S" => "С",
        "s" => "с",
        "T" => "Т",
        "t" => "т",
        "U" => "У",
        "u" => "у",
        "V" => "В",
        "v" => "в",
        "X" => "Х",
        "x" => "х",
        "Y" => "Й",
        "y" => "й",
        "Z" => "З",
        "z" => "з",
        "Ch" => "Ч",
        "ch" => "ч",
        "Sh" => "Ш",
        "sh" => "ш",
        "e" => "э",
        "E" => "Э",
        "Yu" => "Ю",
        "yu" => "ю",
        "Ya" => "Я",
        "ya" => "я",
    ];

    public static function uz2oz($text) {
        $from = [];
        $to = [];

        foreach (self::$uz2oz as $key => $value) {
            $from[] = $key;
            $to[] = $value;
        }

        return str_replace($from, $to, $text);
    }

    public static function oz2uz($text) {
        $from = [];
        $to = [];

        foreach (self::$uz2oz as $key => $value) {
            $from[] = $value;
            $to[] = $key;
        }

        return str_replace($from, $to, $text);
    }
}